PinkFluffyUnic0rn/stm32flight/main.c
#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>

#include "main.h"
#include "driver.h"
#include "uartdebug.h"
#include "mpu6500.h"
#include "bmp280.h"
#include "esp8266.h"
#include "hmc5883l.h"
#include "dsp.h"

// Max length for info packet
// sent back to operator
#define INFOLEN 512

// device numbers
#define MPU_DEV 0
#define BMP_DEV 1
#define HMC_DEV 2

// timer settings
#define PRESCALER 16

#define OCSFREQ 16000000
#define TIMPERIOD 0xffff
#define TICKSPERSEC (OCSFREQ / PRESCALER)

// PWM settings
#define PWM_MAXCOUNT 2500

// DSP settings
#define PID_FREQ 1000
#define MAGNETIC_DECLANATION 0.3264

#define USER_FLASH 0x08020000
#define UESR_SETSLOTS (0x80 / sizeof(struct settings))

#define WIFI_TIMEOUT 3

// Wi-Fi settings:
// 	define SSID
// 	define PASSWORD
// 	define SERIP
// 	define SERVPORT
#include "wifidefs.h"

struct settings {
	float mx0,	my0,		mz0;
	float mxsc,	mysc,		mzsc;
	float gx0,	gy0,		gz0;
	float roll0,	pitch0,		yaw0;

	float tcoef, ttcoef, ptcoef;

	int speedpid;
	int yawspeedpid;
	float p,	i,	d;
	float sp,	si,	sd;
	float yp,	yi,	yd;
	float ysp,	ysi,	ysd;
	float zsp,	zsi,	zsd;
};

void systemclock_config();
static void gpio_init();
static void i2c_init();
static void spi1_init();
static void dma_init();
static void tim1_init();
static void tim2_init();
static void adc1_init(void);
static void usart1_init();
static void usart2_init();
static void esc_init();
static void mpu_init();
static void bmp_init();
static void hmc_init();
static void espdev_init();

ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

// IC drivers
struct driver drivers[4];
struct device dev[4];
struct esp_device espdev;

// DSP contexts
struct dsp_lpf tlpf;
struct dsp_lpf presslpf;

struct dsp_compl pitchcompl;
struct dsp_compl rollcompl;

struct dsp_pidval pitchpv;
struct dsp_pidval rollpv;
struct dsp_pidval pitchspv;
struct dsp_pidval rollspv;
struct dsp_pidval yawpv;
struct dsp_pidval yawspv;
struct dsp_pidval tpv;

// control values
float thrust = 0.0;
float rolltarget = 0.0, pitchtarget = 0.0, yawtarget = 0.0;
float lbw = 0.0, rbw = 0.0, ltw = 0.0, rtw = 0.0;

// pressure and altitude initial values
float alt0, press0;

// settings
struct settings st;

int loopscount = 0;
int wifitimeout = WIFI_TIMEOUT;

uint32_t getadcv(ADC_HandleTypeDef *hadc)
{
	uint32_t v;

	HAL_ADC_Start(hadc);
	HAL_ADC_PollForConversion(hadc, 1);

	v = HAL_ADC_GetValue(hadc);

	HAL_ADC_Stop(hadc);

	return v;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) 
{
	esp_interrupt(&espdev, huart);
}

int mpu_printuart(const struct mpu_data *md)
{
	uartprintf("%-15sx = %hd; y = %hd; z = %hd\n\r",
		"acceleration: ", md->ax, md->ay, md->az);

	uartprintf("%-15sx = %hd; y = %hd; z = %hd\n\r\n\r",
		"rotation: ", md->gx, md->gy, md->gz);

	return 0;
}

int mpu_printuartf(const struct mpu_data *md)
{
	uartprintf("%-15sx = %-.3f; y = %-.3f; z = %-.3f\n\r",
		"acceleration: ", (double) md->afx, (double) md->afy,
		(double) md->afz);

	uartprintf("%-15sx = %-.3f; y = %-.3f; z = %-.3f\n\r\n\r",
		"rotation: ", (double) md->gfx, (double) md->gfy,
		(double) md->gfz);

	return 0;
}

float groundpressure(float alt)
{
	float press;
	float c;
	int i;

	press = 0.0;
	c = 0.0;

	for (i = 0; i < 100; ++i) {
		struct bmp_data bd;
		float t, tt;

		dev[BMP_DEV].read(dev[BMP_DEV].priv, 0, &bd,
			sizeof(struct bmp_data));
	
		tt = bd.press / 100.0
			/ powf(1.0 - (alt / 44330.0), 5.255) - c;
		
		t = press + tt;
	
		c = (t - press) - tt;

		press = t;

		HAL_Delay(10);
	}

	press /= 100.0;

	return press;
}

float getalt(float press0, float press)
{
	return (44330.0 * (1.0 - powf(press / 100.0 / press0,
		1.0 / 5.225)));
}

int averageposition(float *ax, float *ay, float *az, float *gx,
	float *gy, float *gz)
{
	struct mpu_data md;
	float axt, ayt, azt, gxt, gyt, gzt;
	int i;

	axt = ayt = azt = gxt = gyt = gzt = 0;
	for (i = 0; i < 250; ++i) {
		dev[MPU_DEV].read(dev[MPU_DEV].priv, 0, &md,
			sizeof(struct mpu_data));

		gxt += md.gfx;
		gyt += md.gfy;
		gzt += md.gfz;

		axt += md.afx;
		ayt += md.afy;
		azt += md.afz;

		HAL_Delay(10);
	}

	*gx = gxt / 250.0;
	*gy = gyt / 250.0;
	*gz = gzt / 250.0;

	*ax = axt / 250.0;
	*ay = ayt / 250.0;
	*az = azt / 250.0;

	return 0;
}

float hmc_heading(float r, float p, float x, float y, float z)
{
	x = st.mxsc * (x + st.mx0);
	y = st.mysc * (y + st.my0);
	z = st.mzsc * (z + st.mz0);

	x = x * cosf(p) + y * sinf(r) * sinf(p)
		+ z * cosf(r) * sinf(p);
	y = y * cosf(r) - z * sinf(r);

	return circf(atan2f(y, x) + MAGNETIC_DECLANATION);
}

int setthrust(float ltd, float rtd, float rbd, float lbd)
{
	if (isnan(ltd) || isnan(rtd) || isnan(rbd) || isnan(lbd))
		ltd = rtd = rbd = lbd = 0.0;

	TIM1->CCR1 = (uint16_t) ((trimuf(ltd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR2 = (uint16_t) ((trimuf(rtd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR3 = (uint16_t) ((trimuf(rbd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);
	TIM1->CCR4 = (uint16_t) ((trimuf(lbd) * 0.05 + 0.049)
		* (float) PWM_MAXCOUNT);

	return 0;
}

int writesettings(int slot)
{
	FLASH_EraseInitTypeDef ferase;
	uint32_t serror;
	uint32_t sz;
	uint32_t *pt;
	uint32_t addr;
	int j;

	__disable_irq();
	HAL_FLASH_Unlock();

	ferase.TypeErase = FLASH_TYPEERASE_SECTORS;
	ferase.NbSectors = 1;
	ferase.Sector = FLASH_SECTOR_5;
	ferase.VoltageRange = VOLTAGE_RANGE_3;
	HAL_FLASHEx_Erase(&ferase, &serror);

	sz = sizeof(struct settings);

	pt = (uint32_t *) &st;

	addr = USER_FLASH + sizeof(struct settings) * slot;
	for (j = 0; j < sz / 4; ++j) {
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, pt[j]);
		addr += 4;
	}

	HAL_FLASH_Lock();
	__enable_irq();

