PinkFluffyUnic0rn/stm32flight/main.c
	sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
	sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;

	if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
		error_handler();
	
	HAL_TIM_Base_Start_IT(&htim2);
}

static void adc1_init(void)
{
	ADC_ChannelConfTypeDef sConfig = {0};

	hadc1.Instance = ADC1;
	hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
	hadc1.Init.Resolution = ADC_RESOLUTION_12B;
	hadc1.Init.ScanConvMode = ENABLE;
	hadc1.Init.ContinuousConvMode = ENABLE;
	hadc1.Init.DiscontinuousConvMode = DISABLE;
	hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
	hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
	hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
	hadc1.Init.NbrOfConversion = 1;
	hadc1.Init.DMAContinuousRequests = ENABLE;
	hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
	if (HAL_ADC_Init(&hadc1) != HAL_OK)
		error_handler();

	sConfig.Channel = ADC_CHANNEL_1;
	sConfig.Rank = 1;
	sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
	if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
		error_handler();
}

static void usart1_init()
{
	huart1.Instance = USART1;
	huart1.Init.BaudRate = 115200;
	huart1.Init.WordLength = UART_WORDLENGTH_8B;
	huart1.Init.StopBits = UART_STOPBITS_1;
	huart1.Init.Parity = UART_PARITY_NONE;
	huart1.Init.Mode = UART_MODE_TX_RX;
	huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart1.Init.OverSampling = UART_OVERSAMPLING_16;

	if (HAL_UART_Init(&huart1) != HAL_OK)
		error_handler();
}

static void usart2_init()
{
	huart2.Instance = USART2;
	huart2.Init.BaudRate = 921600;
	huart2.Init.WordLength = UART_WORDLENGTH_8B;
	huart2.Init.StopBits = UART_STOPBITS_1;
	huart2.Init.Parity = UART_PARITY_NONE;
	huart2.Init.Mode = UART_MODE_TX_RX;
	huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart2.Init.OverSampling = UART_OVERSAMPLING_16;

	if (HAL_UART_Init(&huart2) != HAL_OK)
		error_handler();
}

static void esc_init()
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4
		= (uint16_t) (0.05 * (float) PWM_MAXCOUNT);
	HAL_Delay(2000);
}

static void mpu_init()
{
	struct mpu_device d;

	mpu_getdriver(drivers + MPU_DEV);

	d.hi2c = &hi2c1;
	d.devtype = MPU_DEV6050;
	d.accelscale = MPU_4G;
	d.gyroscale = MPU_1000DPS;
	d.dlpfwidth = MPU_10DLPF;

	if (drivers[0].initdevice(&d, dev + MPU_DEV) == 0)
		uartprintf("MPU-6500 initilized\r\n");
	else
		uartprintf("failed to initilize MPU-6500\r\n");
}

static void bmp_init()
{
	struct bmp_device d;

	bmp_getdriver(drivers + BMP_DEV);

	d.hi2c = &hi2c1;

	if (drivers[1].initdevice(&d, dev + BMP_DEV) == 0)
		uartprintf("BMP280 initilized\r\n");
	else
		uartprintf("failed to initilize BMP280\r\n");

}

static void hmc_init()
{
	struct hmc_device d;
	hmc_getdriver(drivers + HMC_DEV);

	d.hi2c = &hi2c1;
	d.scale = HMC_SCALE_1_3;
	d.rate = HMC_RATE_15;

	if (drivers[2].initdevice(&d, dev + HMC_DEV) == 0)
		uartprintf("HMC5883L initilized\r\n");
	else
		uartprintf("failed to initilize HMC5883L\r\n");
}

static void espdev_init()
{
	char ip[32];
	
	espdev.huart = &huart1;

	if (esp_init(&espdev, SSID, PASSWORD) < 0) {
		uartprintf("failed to initilize ESP8266\r\n");
		return;
	}

	uartprintf("ESP8266 initilized\r\n");

	uartprintf("getting ip...\r\n");

	if (esp_getip(&espdev, ip) < 0)
		uartprintf("failed to get ip\r\n");
	else
		uartprintf("got ip %s\r\n", ip);

	uartprintf("connecting to %s:%d...\r\n", SERVIP, SERVPORT);
	
	if (esp_connect(&espdev, SERVIP, SERVPORT) < 0) {
		uartprintf("failed to connect to %s %s\r\n",
			SERVIP, SERVPORT);
		return;
	}

	uartprintf("connected\r\n");

}

void error_handler(void)
{
	__disable_irq();
	while (1) {}
}

#ifdef  USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line)
{

}
#endif
